dynamic-soap-endpoint/src/main/resources/Hello.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="HelloService" targetNamespace="urn:samples-switchyard:dynamic-soap-endpoint:1.0"
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="urn:samples-switchyard:dynamic-soap-endpoint:1.0" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:samples-switchyard:dynamic-soap-endpoint:1.0"
      attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="urn:samples-switchyard:dynamic-soap-endpoint:1.0">
      <xsd:element name="hello" type="tns:hello" />
      <xsd:complexType name="hello">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="name" type="xsd:string" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="helloResponse" type="tns:helloResponse" />
      <xsd:complexType name="helloResponse">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="message" type="xsd:string" />
        </xsd:sequence>
      </xsd:complexType>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="hello">
    <wsdl:part name="parameters" element="tns:hello" />
  </wsdl:message>
  <wsdl:message name="helloResponse">
    <wsdl:part name="parameters" element="tns:helloResponse" />
  </wsdl:message>
  <wsdl:portType name="HelloServicePortType">
    <wsdl:operation name="hello">
      <wsdl:input name="hello" message="tns:hello" />
      <wsdl:output name="helloResponse" message="tns:helloResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="HelloServiceSoapBinding" type="tns:HelloServicePortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="hello">
      <soap:operation soapAction="hello" style="document" />
      <wsdl:input name="hello">
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output name="helloResponse">
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="HelloService">
    <wsdl:port name="HelloServicePort" binding="tns:HelloServiceSoapBinding">
      <soap:address location="http://localhost:8080/sample/HelloService" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
